AUM_MAPPER = {
    0: 1,
    5: 2,
    10: 3,
    20: 4,
    50: 5,
    100: 6,
}

PPW_STRATEGY_MAP = {
    1001: "股票策略",
    1002: "债券策略",
    1003: "期货及衍生品策略",
    1004: "多资产策略",
    1005: "组合基金",
    -1: "其它策略"
}

STRATEGY_PPW_MAP = {v: k for k, v in PPW_STRATEGY_MAP.items()}

PPW_SECOND_STRATEGY_MAP = {
    100101: "主观多头",
    100102: "量化多头",
    100103: "股票多空",
    100104: "股票市场中性",

    100201: "纯债策略",
    100202: "债券增强",
    100203: "债券复合策略",
    100204: "转债交易策略",

    100301: "主观CTA",
    100302: "量化CTA",
    100303: "期权策略",
    100304: "其他衍生品策略",

    100401: "宏观策略",
    100402: "套利策略",
    100403: "复合策略",

    100501: "FOF",
    100502: "MOM",

    -1: "其它",
}

SECOND_STRATEGY_PPW_MAP = {v: k for k, v in PPW_SECOND_STRATEGY_MAP.items()}

PPW_THIRD_STRATEGY_MAP = {
    10010101: "主观选股",
    10010102: "定增打新",

    10010201: "沪深300指增",
    10010202: "中证500指增",
    10010203: "中证1000指增",
    10010204: "其他指增",
    10010205: "量化选股",

    10030101: "主观趋势",
    10030102: "主观套利",
    10030103: "主观多策略",

    10030201: "量化趋势",
    10030202: "量化套利",
    10030203: "量化多策略",

    -1: "其它",
}

THIRD_STRATEGY_PPW_MAP = {v: k for k, v in PPW_THIRD_STRATEGY_MAP.items()}

PPW_FUNDTYPE_MAP = {
    1: "信托计划",
    2: "有限合伙",
    3: "券商资管",
    4: "公募专户",
    5: "单账户",
    6: "私募证券",
    7: "海外基金",
    8: "期货资管",
    9: "保险资管",
    10: "创业投资基金",
    11: "股权投资基金",
    12: "银行理财",
    13: "类固收信托 ",
    14: "私募资产配置基金",
    -1: "其他投资基金"
}
FUNDTYPE_PPW_MAP = {v: k for k, v in PPW_FUNDTYPE_MAP.items()}